webwork/instruction-professor.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-07 Wed 22:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Instructions for Professors</title>
<meta name="author" content="Jang Soo Kim" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Instructions for Professors</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org39bdb59">1. Video instruction</a></li>
<li><a href="#orgb604c8d">2. How to login to Webwork</a></li>
<li><a href="#org00e2820">3. Observing student progress</a></li>
<li><a href="#org388eaad">4. Viewing homework problems</a></li>
<li><a href="#orgb268c7d">5. Homework dues</a></li>
<li><a href="#orgcad22f0">6. How to answer student's questions</a></li>
</ul>
</div>
</div>

<div id="outline-container-org39bdb59" class="outline-2">
<h2 id="org39bdb59"><span class="section-number-2">1.</span> Video instruction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://youtu.be/lywyNzUm7-o">https://youtu.be/lywyNzUm7-o</a> (in Korean)</li>
<li><a href="https://youtu.be/17v-8QSzKz8">https://youtu.be/17v-8QSzKz8</a> (in English)</li>
</ul>
</div>
</div>
<div id="outline-container-orgb604c8d" class="outline-2">
<h2 id="orgb604c8d"><span class="section-number-2">2.</span> How to login to Webwork</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Find your class here. <a href="https://webwork.skku.edu">https://webwork.skku.edu</a></li>
<li>The course coordinator or the TA will send you your login id and password.</li>
<li>Once you login, you can change the password by clicking <code>User Settings</code> in the sidebar.</li>
<li>If you enter your email in <code>User Settings</code>, you will be able to receive questions from students through the system.</li>
</ol>
</div>
</div>
<div id="outline-container-org00e2820" class="outline-2">
<h2 id="org00e2820"><span class="section-number-2">3.</span> Observing student progress</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Click <code>Student Progress</code>  under <code>Instructor Tools</code> in the side bar.</li>
<li>You can check student progress by a homework set or by a student</li>
</ol>
</div>
</div>
<div id="outline-container-org388eaad" class="outline-2">
<h2 id="org388eaad"><span class="section-number-2">4.</span> Viewing homework problems</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Click <code>Homework Sets</code> in the sidebar. It will show you homework sets and due dates.</li>
<li>Click the homework set name that you want to view.</li>
<li>You can see each problem by clicking the problem number.</li>
<li>You can also download a pdf file of the homework problems by clicking the <code>Download PDF or TeX Hardcopy for Current Set</code> button.</li>
</ol>
</div>
</div>
<div id="outline-container-orgb268c7d" class="outline-2">
<h2 id="orgb268c7d"><span class="section-number-2">5.</span> Homework dues</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Since the due dates of the homework sets are determined by the schedule, please cover the topics as scheduled in syllabus.</li>
<li>The materials in each week must be covered by the end of the following week at the latest.</li>
<li>If you are not able to do this, please ask the TA to change the due date.</li>
</ul>
</div>
</div>
<div id="outline-container-orgcad22f0" class="outline-2">
<h2 id="orgcad22f0"><span class="section-number-2">6.</span> How to answer student's questions</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Your students can ask questions by clicking a button when they are working on a homework problem.</li>
<li>When they do, you will receive an email that has a link to the problem.</li>
<li>Clink on the link and it will ask you to log in to the webwork page.</li>
<li>After logging in you can see the problem.</li>
<li>You can then reply to the student by email.</li>
<li>In most problems numbers are randomly generated. So what you see in a given
problem is not exactly the same as what your students see.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jang Soo Kim</p>
<p class="date">Created: 2022-12-07 Wed 22:35</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
